Revit 2027 API
ColorFillSchemeEntry.SetStringValue Method
 Sets new String value of entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetStringValue(
	string value
)
Public Sub SetStringValue (
	value As String
)
public:
void SetStringValue(
	String^ value
)
member SetStringValue :
        value : string -> unit
Parameters
value String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The entry has different storage type with String, or the value is empty, or contains forbidden characters.
Remarks
 This method should only be used if the StorageType property reports the type of the entry as a String. New value should be not empty and valid for Revit name.
See Also
Reference
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace